app/views/tasks/edit.html.erb

SELECT "users".* FROM "users" WHERE (users.tenant_id IS NULL)
---
  <div class="field">
      <%= f.select :user_id, User.all.sort.collect { |p| [ p.email, p.id ] } %>

SELECT "projects".* FROM "projects"
---
  <div class="field">
      <%= f.select :project_id, Project.all.sort.collect { |p| [ p.title, p.id ] } %>