app/controllers/confirmations_controller.rb

		def set_confirmable()
			@confirmable = User.find_or_initialize_with_error_by(:confirmation_token, params[:confirmation_token])
---
SELECT  "users".* FROM "users" WHERE (users.tenant_id IS NULL) AND "users"."confirmation_token" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["confirmation_token", "x23-moYkmtPaWJ8_WvB5"]]