app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "stuff"], ["user_id", 1], ["created_at", "2016-05-19 00:03:43.357680"], ["updated_at", "2016-05-19 00:03:43.357680"]]
---
  def create
    puts 'creating a message...'
    @message = Message.create message_params