app/controllers/registrations_controller.rb

def create
    # have a working copy of the params in case Tenant callbacks
    # make any changes
  tenant_params = sign_up_params_tenant
  user_params   = sign_up_params_user.merge({ is_admin: true})
  coupon_params = sign_up_params_coupon

  sign_out_session!
     # next two lines prep signup view parameters
  prep_signup_view( tenant_params, user_params, coupon_params )

     # validate recaptcha first unless not enabled
  if !::Milia.use_recaptcha  ||  verify_recaptcha

    Tenant.transaction  do
      @tenant = Tenant.create_new_tenant( tenant_params, user_params, coupon_params)
---
INSERT INTO "tenants" ("plan", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["plan", "free"], ["name", "sean"], ["created_at", "2016-05-19 00:03:05.668499"], ["updated_at", "2016-05-19 00:03:05.668499"]]
INSERT INTO "users" ("email", "encrypted_password", "is_admin", "skip_confirm_change_password", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"