app/controllers/tasks_controller.rb

  	task = Task.create task_params do |p|
---
INSERT INTO "tasks" ("title", "status", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "fix everything"], ["status", "partially done"], ["user_id", 1], ["project_id", 1], ["created_at", "2016-05-19 00:15:11.340163"], ["updated_at", "2016-05-19 00:15:11.340163"]]

	def edit
    @task = Task.find params[:id]
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    p = Task.find params[:id]
    p.update task_params
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", "done"], ["updated_at", "2016-05-19 00:15:19.166195"], ["id", 1]]

  def destroy
    Task.find(params[:id]).delete
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]

  def unique
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"